; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p3-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s4)
	(at driver5 s4)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s4)
	(at package2 s2)
	(at package3 s2)
	(at package4 s1)
	(at package5 s0)
	(at package6 s1)
	(at package7 s0)
	(at package8 s4)
	(at package9 s1)
	(at package10 s3)
	(at package11 s3)
	(at package12 s4)
	(at package13 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 2)
	(= (time-to-drive s2 s0) 2)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 9)
	(= (time-to-drive s0 s1) 9)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 90)
	(= (time-to-drive s3 s1) 90)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 100)
	(= (time-to-drive s1 s2) 100)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 100)
	(= (time-to-drive s0 s3) 100)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 27)
	(= (time-to-drive s2 s3) 27)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 20)
	(= (time-to-drive s4 s3) 20)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 15)
	(= (time-to-drive s0 s4) 15)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 31)
	(= (time-to-drive s1 s4) 31)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s0)
	(at truck1 s2)
	(at truck2 s1)
	(at truck4 s3)
	(at truck5 s4)
	(at package1 s1)
	(at package2 s2)
	(at package3 s4)
	(at package4 s4)
	(at package5 s3)
	(at package6 s2)
	(at package7 s2)
	(at package8 s4)
	(at package10 s2)
	(at package11 s1)
	(at package12 s3)
	(at package13 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver4 truck2 s4)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 4 of 20
2. (walk driver3 s2 p2-3)
   deleted: (at driver3 s2)
   added: (at driver3 p2-3)
   goals met: 4 of 20
3. (drive-truck truck2 s4 s1 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 0 to 310
   goals met: 5 of 20
4. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 20
5. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 20
6. (drive-truck truck2 s1 s0 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 310 to 427
   goals met: 4 of 20
7. (load-truck package5 truck2 s0)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 20
8. (load-truck package7 truck2 s0)
   deleted: (at package7 s0)
   added: (in package7 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 4 of 20
9. (drive-truck truck2 s0 s1 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 427 to 607
   goals met: 5 of 20
10. (walk driver3 p2-3 s3)
   deleted: (at driver3 p2-3)
   added: (at driver3 s3)
   goals met: 6 of 20
11. (load-truck package10 truck1 s3)
   deleted: (at package10 s3)
   added: (in package10 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 20
12. (load-truck package11 truck1 s3)
   deleted: (at package11 s3)
   added: (in package11 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 6 of 20
13. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 20
14. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 607 to 958
   goals met: 6 of 20
15. (unload-truck package10 truck1 s2)
   deleted: (in package10 truck1)
   added: (at package10 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 20
16. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 958 to 2058
   goals met: 6 of 20
17. (unload-truck package11 truck1 s1)
   deleted: (in package11 truck1)
   added: (at package11 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 20
18. (drive-truck truck1 s1 s3 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 2058 to 2958
   goals met: 7 of 20
19. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 8 of 20
20. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 8 of 20
21. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 20
22. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 2958 to 3228
   goals met: 8 of 20
23. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 3228 to 4228
   goals met: 8 of 20
24. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 9 of 20
25. (drive-truck truck1 s2 s3 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 4228 to 4498
   goals met: 8 of 20
26. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 9 of 20
27. (drive-truck truck2 s1 s3 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 4498 to 6298
   goals met: 8 of 20
28. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 9 of 20
29. (drive-truck truck2 s3 s2 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 6298 to 6730
   goals met: 9 of 20
30. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 9 of 20
31. (unload-truck package7 truck2 s2)
   deleted: (in package7 truck2)
   added: (at package7 s2)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 10 of 20
32. (unload-truck package6 truck2 s2)
   deleted: (in package6 truck2)
   added: (at package6 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 20
33. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 6730 to 8030
   goals met: 12 of 20
34. (drive-truck truck2 s1 s4 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 8030 to 8433
   goals met: 11 of 20
35. (unload-truck package3 truck2 s4)
   deleted: (in package3 truck2)
   added: (at package3 s4)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 12 of 20
36. (unload-truck package4 truck2 s4)
   deleted: (in package4 truck2)
   added: (at package4 s4)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 13 of 20
37. (load-truck package1 truck2 s4)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 13 of 20
38. (load-truck package12 truck2 s4)
   deleted: (at package12 s4)
   added: (in package12 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 13 of 20
39. (drive-truck truck2 s4 s1 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 8433 to 8836
   goals met: 14 of 20
40. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 15 of 20
41. (drive-truck truck2 s1 s3 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 8836 to 9826
   goals met: 14 of 20
42. (unload-truck package12 truck2 s3)
   deleted: (in package12 truck2)
   added: (at package12 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 15 of 20
43. (drive-truck truck2 s3 s0 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 9826 to 10826
   goals met: 15 of 20
44. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 14 of 20
45. (drive-truck truck4 s1 s3 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 10826 to 11726
   goals met: 15 of 20
46. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 16 of 20
47. (walk driver3 s3 p3-1)
   deleted: (at driver3 s3)
   added: (at driver3 p3-1)
   goals met: 15 of 20
48. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 14 of 20
49. (drive-truck truck4 s3 s1 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 11726 to 12626
   goals met: 13 of 20
50. (disembark-truck driver1 truck4 s1)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 14 of 20
51. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 15 of 20
52. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 14 of 20
53. (drive-truck truck2 s0 s1 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 12626 to 12716
   goals met: 15 of 20
54. (board-truck driver1 truck5 s1)
   deleted: (at driver1 s1) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 14 of 20
55. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 14 of 20
56. (walk driver4 s1 p0-1)
   deleted: (at driver4 s1)
   added: (at driver4 p0-1)
   goals met: 14 of 20
57. (disembark-truck driver1 truck5 s1)
   deleted: (driving driver1 truck5)
   added: (at driver1 s1) (empty truck5)
   goals met: 15 of 20
58. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 14 of 20
59. (walk driver3 p3-1 s1)
   deleted: (at driver3 p3-1)
   added: (at driver3 s1)
   goals met: 14 of 20
60. (board-truck driver3 truck5 s1)
   deleted: (at driver3 s1) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 14 of 20
61. (drive-truck truck5 s1 s4 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (fuel-used) from 12716 to 13026
   goals met: 15 of 20
62. (disembark-truck driver1 truck4 s1)
   deleted: (driving driver1 truck4)
   added: (at driver1 s1) (empty truck4)
   goals met: 16 of 20
63. (walk driver1 s1 p3-1)
   deleted: (at driver1 s1)
   added: (at driver1 p3-1)
   goals met: 15 of 20
64. (drive-truck truck5 s4 s3 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (fuel-used) from 13026 to 13226
   goals met: 14 of 20
65. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 15 of 20
66. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 14 of 20
67. (walk driver1 p3-1 s3)
   deleted: (at driver1 p3-1)
   added: (at driver1 s3)
   goals met: 14 of 20
68. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 13226 to 13496
   goals met: 15 of 20
69. (walk driver4 p0-1 s1)
   deleted: (at driver4 p0-1)
   added: (at driver4 s1)
   goals met: 15 of 20
70. (board-truck driver4 truck4 s1)
   deleted: (at driver4 s1) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 15 of 20
71. (drive-truck truck4 s1 s3 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 13496 to 14396
   goals met: 16 of 20
72. (walk driver1 s3 p3-1)
   deleted: (at driver1 s3)
   added: (at driver1 p3-1)
   goals met: 16 of 20
73. (walk driver1 p3-1 s1)
   deleted: (at driver1 p3-1)
   added: (at driver1 s1)
   goals met: 17 of 20
74. (drive-truck truck4 s3 s0 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 14396 to 15396
   goals met: 16 of 20
75. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 17 of 20
76. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 16 of 20
77. (drive-truck truck4 s0 s3 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 15396 to 16396
   goals met: 17 of 20
78. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 17 of 20
79. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 17 of 20
80. (walk driver3 s2 p2-3)
   deleted: (at driver3 s2)
   added: (at driver3 p2-3)
   goals met: 17 of 20
81. (walk driver3 p2-3 s3)
   deleted: (at driver3 p2-3)
   added: (at driver3 s3)
   goals met: 18 of 20
82. (board-truck driver3 truck5 s3)
   deleted: (at driver3 s3) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 17 of 20
83. (drive-truck truck5 s3 s4 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   changed: (fuel-used) from 16396 to 16596
   goals met: 18 of 20
84. (disembark-truck driver3 truck5 s4)
   deleted: (driving driver3 truck5)
   added: (at driver3 s4) (empty truck5)
   goals met: 18 of 20
85. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 18 of 20
86. (board-truck driver5 truck5 s4)
   deleted: (at driver5 s4) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 18 of 20
87. (drive-truck truck5 s4 s3 driver5)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (fuel-used) from 16596 to 16796
   goals met: 17 of 20
88. (drive-truck truck4 s3 s4 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (fuel-used) from 16796 to 16996
   goals met: 16 of 20
89. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 16 of 20
90. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 16 of 20
91. (drive-truck truck4 s4 s3 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (fuel-used) from 16996 to 17196
   goals met: 17 of 20
92. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 18 of 20
93. (drive-truck truck5 s3 s0 driver5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (fuel-used) from 17196 to 18196
   goals met: 18 of 20
94. (disembark-truck driver5 truck5 s0)
   deleted: (driving driver5 truck5)
   added: (at driver5 s0) (empty truck5)
   goals met: 18 of 20
95. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   goals met: 18 of 20
96. (board-truck driver5 truck5 s0)
   deleted: (at driver5 s0) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 18 of 20
97. (drive-truck truck5 s0 s4 driver5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (fuel-used) from 18196 to 18346
   goals met: 19 of 20
98. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   goals met: 19 of 20
99. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 19 of 20
100. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 20 of 20
